//-------------------------------------------------------------------
//
// キャラセレクトノーンヘッダー (chara_select_none.h)
// Author:Itsuki Takaiwa
//
//-------------------------------------------------------------------
#ifndef _CHARASELECTNONE_H_
#define _CHARASELECTNONE_H_

#include "main.h"

//-------------------------------------------------------------------
// マクロ定義
//-------------------------------------------------------------------
#define MAX_CHARANONE		(2)						// テクスチャ枚数

//-----------------------------------------------------------------
// 構造体の定義
//-----------------------------------------------------------------
typedef struct
{
	D3DXVECTOR3 pos;		// 位置
	D3DXCOLOR col;			// 色
	float fWidth;			// 幅
	float fHeight;			// 高さ
	bool bSelect;			// 選択されたかどうか
}CharaSelectNone;

//-------------------------------------------------------------------
// プロトタイプ宣言
//-------------------------------------------------------------------
HRESULT InitCharaSelectNone(void);			// キャラセレクトノーンの初期化処理
void UninitCharaSelectNone(void);			// キャラセレクトノーンの終了処理
void UpdateCharaSelectNone(void);			// キャラセレクトノーンの更新処理
void DrawCharaSelectNone(void);			// キャラセレクトノーンの描画処理

#endif