//-------------------------------------------------------------------
//
// ライトヘッダー (light.h)
// Author:Itsuki Takaiwa
//
//-------------------------------------------------------------------
#ifndef _LIGHT_H_
#define _LIGHT_H_

#include "main.h"

//-----------------------------------------------------------------
// マクロ定義
//-----------------------------------------------------------------
#define MAX_LIGHT		(10)				// ライトの最大数

//-------------------------------------------------------------------
// 構造体の定義
//-------------------------------------------------------------------
typedef struct
{
	D3DLIGHT9 aLightInfo[MAX_LIGHT];			// ライト情報
	D3DCOLORVALUE colDef[MAX_LIGHT];			// 色情報
	D3DXVECTOR3 vecDir[MAX_LIGHT];				// 設定用方向ベクトル
	int nNumLight;								// ライトの設置数
	int nCntLight;								// 何番目のライトか
}Light;

//-------------------------------------------------------------------
// プロトタイプ宣言
//-------------------------------------------------------------------
void InitLight(void);			// ライトの初期化処理
void UninitLight(void);			// ライトの終了処理
void UpdateLight(void);			// ライトの更新処理

Light *GetLight(void);			// ライト情報の取得

#endif