//-------------------------------------------------------------------
//
// キャラデータ詠み込みヘッダー (LoadCharacterData.h)
// Author:Itsuki Takaiwa
//
//-------------------------------------------------------------------
#ifndef _LOADCHARACTERDATA_H_
#define _LOADCHARACTERDATA_H_

#include "main.h"

//-------------------------------------------------------------------
// プロトタイプ宣言
//-------------------------------------------------------------------
void LoadCharacterData(void);		// キャラデータの読み込み
void LoadCharacterInfo(void);		// キャラクター情報を読み込む

#endif