//-------------------------------------------------------------------
//
// データ読み込みヘッダー (LoadData.h)
// Author:Itsuki Takaiwa
//
//-------------------------------------------------------------------
#ifndef _LOADDATA_H_
#define _LOADDATA_H_

#include "main.h"

//-------------------------------------------------------------------
// プロトタイプ宣言
//-------------------------------------------------------------------
void InitLoadData(void);		// ステージ情報の読み込み
void UpdateData(void);			// シーン情報の更新
void ReleaseData(void);			// リリース

#endif