//-------------------------------------------------------------------
//
// タイマー背景ヘッダー (timer_bg.h)
// Author:Itsuki Takaiwa
//
//-------------------------------------------------------------------
#ifndef _TIMERBG_H_
#define _TIMERBG_H_

#include "main.h"

//-------------------------------------------------------------------
// プロトタイプ宣言
//-------------------------------------------------------------------
HRESULT InitTimerBg(void);	// タイマー背景の初期化処理
void UninitTimerBg(void);	// タイマー背景の終了処理
void UpdateTimerBg(void);	// タイマー背景の更新処理
void DrawTimerBg(void);		// タイマー背景の描画処理


#endif